Revit 2026 API

# VertexIndexPairArrayIterator Constructor

---

For Internal Use Only.

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public VertexIndexPairArrayIterator()
```
```vb
Public Sub New
```
```cpp
public:
VertexIndexPairArrayIterator()
```
```fsharp
new : unit -> VertexIndexPairArrayIterator
```

This constructor is exposed to enable support for COM interop only. This object should never be created by the developer.

#### Reference

VertexIndexPairArrayIterator Class

Autodesk.Revit.DB Namespace